[
  {
        "season": 1,
        "episode": 1,
        "episode_name": "Pilot",
        "description": "Shawn offers to cut one up for the road to the lake house."
    },
    {
        "season": 1,
        "episode": 2,
        "episode_name": "Spellingg Bee",
        "description": "When Henry comes home and Shawn is working on the doghouse, he's holding a slice of pineapple in his hand."
    },
    {
        "season": 1,
        "episode": 3,
        "episode_name": "Speak Now or Forever Hold Your Piece",
        "description": "There is some sliced pineapple on a fruit platter in the bridal suite."
    },
    {
        "season": 1,
        "episode": 4,
        "episode_name": "Woman Seeking Dead Husband: Smokers Okay, No Pets",
        "description": "Buzz brings Shawn a pineapple smoothie."
    },
    {
        "season": 1,
        "episode": 5,
        "episode_name": "9 Lives",
        "description": "When Shawn and Gus visit the stress line they take a pineapple as a gift."
    },
    {
        "season": 1,
        "episode": 6,
        "episode_name": "Weekend Warriors",
        "description": "Shawn and Burton drink Pineapple-flavored Snapple when watching Lassie reenact in the 'Annual Civil War Re-Enactors' Meltdown'. The large gold tassel on Gus' military uniform could be a pineapple tassel."
    },
    {
        "season": 1,
        "episode": 7,
        "episode_name": "Who Ya Gonna Call?",
        "description": "While at Robert Dunn's house, there's an open box of pizza which looks to have pineapple chunks on it. Also, when Shawn and Gus find Regina's hideaway, there's a pineapple-shaped perfume bottle on her make-up dresser."
    },
    {
        "season": 1,
        "episode": 8,
        "episode_name": "Shawn vs. the Red Phantom",
        "description": "When Shawn and Gus are buying churros and discussing the missing blogger, a woman in a blue shirt walks behind them with what looks like pineapples all over her grocery bag. Also, what looks like pineapple leaves are sticking out of the top. There is also a coffee mug with a pineapple on it behind Juliet when she is talking to Gus about the comic book convention."
    },
    {
        "season": 1,
        "episode": 9,
        "episode_name": "Forget Me Not",
        "description": "Shawn mentions the delicious pineapple scones at a local restaurant, and at the end of the episode, one of those scones is sitting on a table next to Shawn."
    },
    {
        "season": 1,
        "episode": 10,
        "episode_name": "From the Earth to Starbucks",
        "description": "When Shawn is meeting his father at a bar, a guy in a green shirt with pineapples on it walks by before the camera settles on Henry."
    },
    {
        "season": 1,
        "episode": 11,
        "episode_name": "He Loves Me, He Loves Me Not, He Loves Me, Oops He's Dead!",
        "description": "In a deleted scene Shawn is drinking out of a pineapple juice box."
    },
    {
        "season": 1,
        "episode": 12,
        "episode_name": "Cloudy... With a Chance of Murder",
        "description": "In the teaser, Shawn is eating sliced pineapple from a plastic container."
    },
    {
        "season": 1,
        "episode": 13,
        "episode_name": "Game, Set... Muuurder?",
        "description": "At the Indian restaurant, the woman eating looks to have some pineapple on her plate."
    },
    {
        "season": 1,
        "episode": 14,
        "episode_name": "Poker? I Barely Know Her",
        "description": "A waitress walks by with a pineapple slice on the rim of a drink."
    },
    {
        "season": 1,
        "episode": 15,
        "episode_name": "Scary Sherry: Bianca's Toast",
        "description": "Shawn asks Alice Bundy if she would like to split a pineapple."
    },
    {
        "season": 2,
        "episode": 1,
        "episode_name": "American Duos",
        "description": "Shawn brings Emilina a pineapple when he visits her in the hospital. Also, during dinner there is a pineapple near a bunch of other fruits behind Shawn in the shot where Gus sets down the corn."
    },
    {
        "season": 2,
        "episode": 2,
        "episode_name": "65 Million Years Off",
        "description": "During the 'intervention' scene in Henry's kitchen you can see the pineapple on the kitchen counter."
    },
    {
        "season": 2,
        "episode": 3,
        "episode_name": "Psy vs. Psy",
        "description": "Shawn is seen baking a pineapple upside-down cake in an Easy-Bake Oven. Later on in the episode Henry is seen eating one as well."
    },
    {
        "season": 2,
        "episode": 4,
        "episode_name": "Zero to Murder in Sixty Seconds",
        "description": "On a date, Shawn is seen with a glass of water that has a pineapple chunk in it."
    },
    {
        "season": 2,
        "episode": 5,
        "episode_name": "And Down the Stretch Comes Murder",
        "description": "Shawn is wearing a pineapple shirt in one scene."
    },
    {
        "season": 2,
        "episode": 6,
        "episode_name": "Meat Is Murder, But Murder Is Also Murder",
        "description": "At the newspaper Gus blurts out '...key-laces, shoe-horses, pineapples!'"
    },
    {
        "season": 2,
        "episode": 7,
        "episode_name": "If You're So Smart, Then Why Are You Dead?",
        "description": "When the kids are hacking the juvenile records on Henry's computer, it looks like there are two pineapple-shaped salt-and-pepper shakers on Henry's tiki bar behind them."
    },
    {
        "season": 2,
        "episode": 8,
        "episode_name": "Rob-a-Bye Baby",
        "description": "Shawn has a pineapple patch on his shirt. Shawn is disgusted by the pineapple-popcorn-flavored jellybeans he's eating. Shawn gives Vick a pineapple as a 'baby present.'"
    },
    {
        "season": 2,
        "episode": 9,
        "episode_name": "Bounty Hunters!",
        "description": "There is a picture of a pineapple in the underground garage."
    },
    {
        "season": 2,
        "episode": 10,
        "episode_name": "Gus' Dad May Have Killed an Old Guy",
        "description": "Shawn gets a pineapple from Henry's fridge."
    },
    {
        "season": 2,
        "episode": 11,
        "episode_name": "There's Something About Mira",
        "description": "Shawn takes the pineapple appetizers with him. There is a pineapple on the reception table after the wedding. Shawn has a pineapple emblem on his shirt when he's golfing with Gus. He also mentions pineapples in the Portuguese phrase he says to Jan."
    },
    {
        "season": 2,
        "episode": 12,
        "episode_name": "The Old and the Restless",
        "description": "The lamps in the senior community center have pineapples on them."
    },
    {
        "season": 2,
        "episode": 13,
        "episode_name": "Lights, Camera... Homicidio",
        "description": "Kelly from Craft Services gives Shawn pineapple Peking dumplings. Also, when Jorge Gama-Lobo is packing in his studio there is a pineapple right next to the box."
    },
    {
        "season": 2,
        "episode": 14,
        "episode_name": "Dis-Lodged",
        "description": "A pineapple can be seen in a background mural as Shawn and Gus exit their car at Dr. Downs' office."
    },
    {
        "season": 2,
        "episode": 15,
        "episode_name": "Black and Tan: A Crime of Fashion",
        "description": ""
    },
    {
        "season": 2,
        "episode": 16,
        "episode_name": "Shawn (and Gus) of the Dead",
        "description": "There's a pineapple in the kitchen when Henry is cleaning it. There is a wrapped-up pineapple on Vick's table of gifts. When the group is looking at the open coffin in the museum, the stained glass in the background has part of a pineapple on it."
    },
 {
        "season": 3,
        "episode": 1,
        "episode_name": "Ghosts",
        "description": "There's a pineapple on the island in Henry's kitchen. There's a pineapple on Paul Haversham's kitchen counter. There is a pineapple on a corner coffee table at Mr. Haversham's. Another pineapple can be seen in a shopping cart in the background. Pineapple lamps in the office with Lassiter and Madeleine."
    },
    {
        "season": 3,
        "episode": 2,
        "episode_name": "Murder? ... Anyone? ... Anyone? ... Bueller?",
        "description": "There's a pineapple on the sign table, in Henry's kitchen, and on the food table with hors d'oeuvres stuck in it with toothpicks."
    },
    {
        "season": 3,
        "episode": 3,
        "episode_name": "Daredevils!",
        "description": "There are two pineapples made out of tissues hanging from an inflatable palm tree."
    },
    {
        "season": 3,
        "episode": 4,
        "episode_name": "The Greatest Adventure in the History of Basic Cable",
        "description": "The cookie jar in Henry's kitchen is shaped like a pineapple. He also has a plastic pineapple in his living room when he answers Shawn's call. And there is one painted on the cave wall."
    },
    {
        "season": 3,
        "episode": 5,
        "episode_name": "Disco Didn't Die. It Was Murdered!",
        "description": "There's a pineapple in the ex-radical's kitchen. In the opening scene where the guy is making a bomb, Henry and three other police officers bust open the door and there is a lamp with a purple pineapple-shaped base."
    },
    {
        "season": 3,
        "episode": 6,
        "episode_name": "There Might Be Blood",
        "description": "There's a Hawaiian pizza (with pineapple) in the victim's house. There is also an old ham-and-pineapple pizza in the inspector's house."
    },
    {
        "season": 3,
        "episode": 7,
        "episode_name": "Talk Derby to Me",
        "description": ""
    },
    {
        "season": 3,
        "episode": 8,
        "episode_name": "Gus Walks into a Bank",
        "description": "There is a pineapple when Shawn has to go to the bathroom in the bank. The Snack Delivery System has a pineapple shape carved into it right above the hot dogs. Shawn mentions ham-and-pineapple pizza while delivering the eight pizzas into the bank."
    },
    {
        "season": 3,
        "episode": 9,
        "episode_name": "Christmas Joy",
        "description": "Shawn pulls a pineapple out of a box of decorations. There's also a pineapple on a serving tray over Henry's shoulder in his kitchen."
    },
    {
        "season": 3,
        "episode": 10,
        "episode_name": "Six Feet Under the Sea",
        "description": ""
    },
    {
        "season": 3,
        "episode": 11,
        "episode_name": "Lassie Did a Bad, Bad Thing",
        "description": "There's a pineapple sticking out of the top of the bag of groceries under Lassiter's right arm. There's a wooden pineapple on top of the tiki bar in Henry's house."
    },
    {
        "season": 3,
        "episode": 12,
        "episode_name": "Earth, Wind and... Wait for It",
        "description": "There is a pineapple on Vick's desk during the closed-blind meeting."
    },
    {
        "season": 3,
        "episode": 13,
        "episode_name": "Any Given Friday Night at 10pm, 9pm Central",
        "description": "On his desk, Lassiter has a clear plastic smoothie cup with a pineapple embossed on it."
    },
    {
        "season": 3,
        "episode": 14,
        "episode_name": "Truer Lies",
        "description": "At the restaurant, a woman is drinking from a pineapple behind Gus and Shawn. Tom Lieber has a cup of pineapple on the tray in front of him at the hospital. There are crates filled with pineapples, as well as pineapples in the dumpsters, when Shawn and Ryan Bainsworth are trapped in the alley."
    },
    {
        "season": 3,
        "episode": 15,
        "episode_name": "Tuesday the 17th",
        "description": "In the flashback Gus's piñata is of a pineapple and the kid who wore a jacket all week is standing in front of a teepee that has a picture on it of a woman holding a pineapple. Later, there's a pineapple in the staff room fridge."
    },
    {
        "season": 3,
        "episode": 16,
        "episode_name": "An Evening with Mr. Yang",
        "description": "There's a pineapple on Abigail's desk at the school."
    },
        {
        "season": 4,
        "episode": 1,
        "episode_name": "Extradition: British Columbia",
        "description": "The balloon artist Shawn hired had a pineapple-shaped balloon on display."
    },
    {
        "season": 4,
        "episode": 2,
        "episode_name": "He Dead",
        "description": "Glass pineapple next to the family photos at Warren Clayton's estate. On one of the serving tables at the country club restaurant, there is a silver tray with sliced pineapple on it."
    },
    {
        "season": 4,
        "episode": 3,
        "episode_name": "High Noon-ish",
        "description": "In Henry's kitchen, there is a ceramic pineapple on the kitchen counter right next to the sink. There is a wooden pineapple on the fireplace mantel."
    },
    {
        "season": 4,
        "episode": 4,
        "episode_name": "The Devil Is in the Details... and the Upstairs Bedroom",
        "description": "Agatha has a picture of a pineapple up on her 'Facebook' page. Near the end, there is also a wooden pineapple in Henry's living room."
    },
    {
        "season": 4,
        "episode": 5,
        "episode_name": "Shawn Gets the Yips",
        "description": "On Gus's nightstand, there is a pineapple behind the alarm clock. There is a pineapple on a tombstone in the graveyard."
    },
    {
        "season": 4,
        "episode": 6,
        "episode_name": "Bollywood Homicide",
        "description": "There is a pineapple lamp behind Rajesh Singh's grandmother's head at dinner."
    },
    {
        "season": 4,
        "episode": 7,
        "episode_name": "High Top Fade-Out",
        "description": "There is a pineapple on a background table as Shawn tells Gus that it has always been his dream to join an a cappella group."
    },
    {
        "season": 4,
        "episode": 8,
        "episode_name": "Let's Get Hairy",
        "description": "A pineapple night-light can be seen when Gus is wiping the leather office chair. One of Henry's opponents is drinking from a pineapple-shaped bottle."
    },
    {
        "season": 4,
        "episode": 9,
        "episode_name": "Shawn Takes a Shot in the Dark",
        "description": "There is a pineapple on the door mat of Shawn's apartment."
    },
    {
        "season": 4,
        "episode": 10,
        "episode_name": "You Can't Handle This Episode",
        "description": "There is a ceramic pineapple jar on Abigail's dresser."
    },
    {
        "season": 4,
        "episode": 11,
        "episode_name": "Thrill Seekers and Hell Raisers",
        "description": "On the climbing wall, one of the handholds is a pineapple."
    },
    {
        "season": 4,
        "episode": 12,
        "episode_name": "A Very Juliet Episode",
        "description": "When Shawn, Gus, and Scott Seaver are in the warehouse, a pineapple is visible through a window when Scott points to John T. Waring's office."
    },
    {
        "season": 4,
        "episode": 13,
        "episode_name": "Death Is in the Air",
        "description": "Shawn asks for three pineapple wedges in his club soda at the tiki bar. Also, a wooden pineapple can be seen behind them on the bar in the same scene."
    },
    {
        "season": 4,
        "episode": 14,
        "episode_name": "Think Tank",
        "description": "Shawn demands pineapple for the pizza he is making after he accuses the wrong person at the restaurant."
    },
    {
        "season": 4,
        "episode": 15,
        "episode_name": "The Head, the Tail, the Whole Damn Episode",
        "description": "Henry is eating pineapple when Shawn confronts him in his kitchen about hunting down the shark. Also, at the end of the episode, Shawn gives his father sun cream which has a pineapple on the front."
    },
    {
        "season": 4,
        "episode": 16,
        "episode_name": "Mr. Yin Presents...",
        "description": "There is a pineapple atop the fountain by the staircase used by Lassiter and Juliet."
    },
        {
        "season": 5,
        "episode": 1,
        "episode_name": "Romeo and Juliet and Juliet",
        "description": "Some lanterns in early shots of Chinatown are shaped like pineapples."
    },
    {
        "season": 5,
        "episode": 2,
        "episode_name": "Feet Don't Kill Me Now",
        "description": "There is a pineapple that can be seen on Lillian's desk as Shawn passes by it."
    },
    {
        "season": 5,
        "episode": 3,
        "episode_name": "Not Even Close... Encounters",
        "description": "There is a pineapple air freshener in Dennis Gogolack's secret nerd room."
    },
    {
        "season": 5,
        "episode": 4,
        "episode_name": "Chivalry Is Not Dead... But Someone Is",
        "description": "Shawn and Gus had pineapple on the pizza they shared with Gillian Tucker and Eugenia. There is a pineapple on the table behind Clive Prescott as Eugenia is getting arrested."
    },
    {
        "season": 5,
        "episode": 5,
        "episode_name": "Shawn and Gus in Drag (Racing)",
        "description": "There is a wooden pineapple tray in Tommy Nix's car garage."
    },
    {
        "season": 5,
        "episode": 6,
        "episode_name": "Viagra Falls",
        "description": "Boone's beverage at the bar includes some pineapple."
    },
    {
        "season": 5,
        "episode": 7,
        "episode_name": "Ferry Tale",
        "description": "There's a pineapple on a passenger's tote bag. There's a wooden pineapple on Mrs. Dunn's mantelpiece."
    },
    {
        "season": 5,
        "episode": 8,
        "episode_name": "Shawn 2.0",
        "description": "At the wedding reception, one of the lamps is a white wooden pineapple."
    },
    {
        "season": 5,
        "episode": 9,
        "episode_name": "One, Maybe Two, Ways Out",
        "description": "There is a pineapple pencil holder behind a Newton's cradle in the SBPD."
    },
    {
        "season": 5,
        "episode": 10,
        "episode_name": "Extradition II: The Actual Extradition Part",
        "description": "There is a glass pineapple in Shawn and Gus's hotel room."
    },
    {
        "season": 5,
        "episode": 11,
        "episode_name": "In Plain Fright",
        "description": "One of the staff members has the nametag 'Piña' which means pineapple in Spanish."
    },
    {
        "season": 5,
        "episode": 12,
        "episode_name": "Dual Spires",
        "description": "There is a pineapple on Shawn’s desk in the intro, and in a bowl of fruit on Robert Barker's living room table."
    },
    {
        "season": 5,
        "episode": 13,
        "episode_name": "We'd Like to Thank the Academy",
        "description": "There is a pineapple on a shelf at the SBPD. There are also pineapples in the store."
    },
    {
        "season": 5,
        "episode": 14,
        "episode_name": "The Polarizing Express",
        "description": "There are pineapple utensil holders on Harry's tiki bar. Pineapples on Henry's quilt."
    },
    {
        "season": 5,
        "episode": 15,
        "episode_name": "Dead Bear Walking",
        "description": "There is a pineapple on the tea pot and a corresponding jar on the counter at the hippie restaurant."
    },
    {
        "season": 5,
        "episode": 16,
        "episode_name": "Yang 3 in 2D",
        "description": "There is a small, clay pineapple in Henry's kitchen."
    },
    {
        "season": 6,
        "episode": 1,
        "episode_name": "Shawn Rescues Darth Vader",
        "description": "The pineapple is located on the banister of the staircase at the mansion. The cutout in Shawn's wallet is also in the shape of a pineapple."
    },
    {
        "season": 6,
        "episode": 2,
        "episode_name": "Last Night Gus",
        "description": "The shot glasses at the bar and the glasses in Gus's apartment have small pineapples on them."
    },
    {
        "season": 6,
        "episode": 3,
        "episode_name": "This Episode Sucks",
        "description": "There is a pineapple candle on the table."
    },
    {
        "season": 6,
        "episode": 4,
        "episode_name": "The Amazing Psych-Man & Tap-Man, Issue 2",
        "description": "There is a pineapple next to the Psych title on the opening credits comic page. There's also a pineapple salt shaker on the table during Shawn and Juliet's date."
    },
    {
        "season": 6,
        "episode": 5,
        "episode_name": "Dead Man's Curve Ball",
        "description": "There is a pineapple shot glass at the bar."
    },
    {
        "season": 6,
        "episode": 6,
        "episode_name": "Shawn, Interrupted",
        "description": "Shawn asks for pineapple 'razzmatazzes' at the Jamba Juice. There is also a pineapple in the fruit basket at the Jamba Juice."
    },
    {
        "season": 6,
        "episode": 7,
        "episode_name": "In for a Penny...",
        "description": "Shawn and Gus are seen having a drink with Juliet's dad. As Juliet's dad sits down, you can see the pineapple in the background between Shawn and Gus."
    },
    {
        "season": 6,
        "episode": 8,
        "episode_name": "The Tao of Gus",
        "description": "There is a pineapple on the table cloth in the cabin, and there is a rustic pineapple nailed to a fruit stand."
    },
    {
        "season": 6,
        "episode": 9,
        "episode_name": "Neil Simon's Lover's Retreat",
        "description": "While in the hot air balloon, there is a pineapple cheese knife."
    },
    {
        "season": 6,
        "episode": 10,
        "episode_name": "Indiana Shawn and the Temple of the Kinda Crappy, Rusty Old Dagger",
        "description": "There is a pineapple doodle on the blackboard."
    },
    {
        "season": 6,
        "episode": 11,
        "episode_name": "Heeeeere's Lassie",
        "description": "There are pineapple slices on the ham in Lassiter's 'Welcome Basket'."
    },
    {
        "season": 6,
        "episode": 12,
        "episode_name": "Shawn and the Real Girl",
        "description": "There is a pineapple candle holder during the dinner date at the mansion."
    },
    {
        "season": 6,
        "episode": 13,
        "episode_name": "Let's Doo-Wop It Again",
        "description": "There is a pineapple-shaped flower in a flower vase."
    },
    {
        "season": 6,
        "episode": 14,
        "episode_name": "Autopsy Turvy",
        "description": "A small pineapple is visible on the lowest fridge magnet in Bob White's apartment."
    },
    {
        "season": 6,
        "episode": 15,
        "episode_name": "True Grits",
        "description": "The jewelry store manager is wearing a pineapple brooch. There are also pineapple paintings on the restaurant wall."
    },
    {
        "season": 6,
        "episode": 16,
        "episode_name": "Santabarbaratown",
        "description": "There is a pineapple candy dish at Bea's house."
    },
    {
        "season": 7,
        "episode": 1,
        "episode_name": "Santabarbaratown 2",
        "description": "There is a small trinket pineapple on the desk in the Psych office."
    },
    {
        "season": 7,
        "episode": 2,
        "episode_name": "Juliet Takes a Luvvah",
        "description": "A small pineapple is on a bookshelf in the Psych office."
    },
    {
        "season": 7,
        "episode": 3,
        "episode_name": "Lassie Jerky",
        "description": "The pineapple appears as a wooden napkin holder on the TV tray behind Lassie in Ed Dixon's cabin."
    },
    {
        "season": 7,
        "episode": 4,
        "episode_name": "No Country for Two Old Men",
        "description": "There is a pineapple on the fruit stand sign in Mexico."
    },
    {
        "season": 7,
        "episode": 5,
        "episode_name": "100 Clues",
        "description": "The 'screaming' doorbell at the mansion is a small pineapple. There is also a pineapple by James Roday Rodriguez's picture during the opening credits."
    },
    {
        "season": 7,
        "episode": 6,
        "episode_name": "Cirque du Soul",
        "description": "There is a pineapple on the dry-erase board in Woody's office."
    },
    {
        "season": 7,
        "episode": 7,
        "episode_name": "Deez Nups",
        "description": "At the casino, a pineapple appears on the marquee during Shawn's vision."
    },
    {
        "season": 7,
        "episode": 8,
        "episode_name": "Right Turn or Left for Dead",
        "description": "In Elin's guest house, there is a small pineapple figurine with arms and legs."
    },
    {
        "season": 7,
        "episode": 9,
        "episode_name": "Juliet Wears the Pantsuit",
        "description": "There is a pineapple on Dave's shirt. There is a patch of light in the shape of a pineapple behind Juliet in her final confrontation with the murderer."
    },
    {
        "season": 7,
        "episode": 10,
        "episode_name": "Santa Barbarian Candidate",
        "description": "There is a pineapple on the side of a box that Shawn and Gus are using in their model."
    },
    {
        "season": 7,
        "episode": 11,
        "episode_name": "Office Space",
        "description": "There is a pineapple on the Scratch & Sniff Stickers."
    },
    {
        "season": 7,
        "episode": 12,
        "episode_name": "Dead Air",
        "description": "There is a pineapple towel on a chair at Crock's ex-partner's home."
    },
    {
        "season": 7,
        "episode": 13,
        "episode_name": "Nip and Suck It",
        "description": "There are pineapples on the cookies from Rachael. There is also a wooden pineapple behind Henry on the tiki bar."
    },
    {
        "season": 7,
        "episode": 14,
        "episode_name": "No Trout About It",
        "description": "There are pineapples on Harris Trout's tie. There is also a pineapple on a flavored syrup bottle at the snow cone stand."
    },
    {
        "season": 7,
        "episode": 15,
        "episode_name": "Psych: The Musical",
        "description": "A pineapple is thrown to Shawn during the opening number, 'Santa Barbara Skies'."
    },
        {
        "season": 8,
        "episode": 1,
        "episode_name": "Lock, Stock, Some Smoking Barrels and Burton Guster's Goblet of Fire",
        "description": "A pineapple appears in the opening credits."
    },
    {
        "season": 8,
        "episode": 2,
        "episode_name": "S.E.I.Z.E. the Day",
        "description": "There is a pineapple in the fruit bowl at Patrick's home."
    },
    {
        "season": 8,
        "episode": 3,
        "episode_name": "Remake A.K.A. Cloudy... With a Chance of Improvement",
        "description": "The woman sitting behind the prosecutor, while the lawyer and Gus stall, has pineapples on her dress. There are also 'pineapple' palm trees in the evidence video."
    },
    {
        "season": 8,
        "episode": 4,
        "episode_name": "Someone's Got a Woody",
        "description": "Trout is wearing pineapple cuff links."
    },
    {
        "season": 8,
        "episode": 5,
        "episode_name": "Cog Blocked",
        "description": "There are pineapple scrolling lights in the restaurant where they find Emmanuelle."
    },
    {
        "season": 8,
        "episode": 6,
        "episode_name": "1967: A Psych Odyssey",
        "description": "There is a pineapple on a straw in a drink."
    },
    {
        "season": 8,
        "episode": 7,
        "episode_name": "Shawn and Gus Truck Things Up",
        "description": "There is a pineapple on the Froot Loops box."
    },
    {
        "season": 8,
        "episode": 8,
        "episode_name": "A Touch of Sweevil",
        "description": "There is a pineapple on a shelf in the Psych office."
    },
    {
        "season": 8,
        "episode": 9,
        "episode_name": "A Nightmare on State Street",
        "description": "There are two pineapples on the kitchen counter of the creepy home Gus enters when he leaves the cable van."
    },
    {
        "season": 8,
        "episode": 10,
        "episode_name": "The Break-Up",
        "description": "There is a pineapple on the window sill at Henry's house."
    }
]