[
    {
        "fun_fact": "The show Psych was inspired by creator Steve Franks' love for detective shows and his relationship with his father."
    },
    {
        "fun_fact": "James Roday Rodriguez, who plays Shawn Spencer, co-wrote many episodes and even directed several of them."
    },
    {
        "fun_fact": "Dulé Hill, who portrays Burton 'Gus' Guster, is an accomplished tap dancer and showcased his skills in multiple episodes."
    },
    {
        "fun_fact": "The iconic pineapple became a running gag on Psych after it was ad-libbed by James Roday in the pilot episode."
    },
    {
        "fun_fact": "Psych is set in Santa Barbara, California, but it was actually filmed in Vancouver, Canada."
    },
    {
        "fun_fact": "The character Lassiter’s full name is Carlton Jebediah Lassiter, a fact that’s revealed later in the series."
    },
    {
        "fun_fact": "The Psych office's phone number is 1-800-555-0199, a commonly used fake phone number in TV shows."
    },
    {
        "fun_fact": "Maggie Lawson, who plays Juliet O'Hara, and James Roday Rodriguez dated in real life during much of the show's run."
    },
    {
        "fun_fact": "Each episode of Psych has at least one hidden pineapple somewhere in the scene or dialogue."
    },
    {
        "fun_fact": "Timothy Omundson, who plays Lassiter, originally auditioned for the role of Shawn Spencer."
    },
    {
        "fun_fact": "Cary Elwes, known for his role in 'The Princess Bride,' made guest appearances as the master thief Pierre Despereaux in several episodes."
    },
    {
        "fun_fact": "The theme song 'I Know You Know' was performed by The Friendly Indians, a band led by show creator Steve Franks."
    },
    {
        "fun_fact": "The character of Gus is known for having several obscure nicknames, like 'Lavender Gooms' and 'Ghee Buttersnaps,' which Shawn makes up throughout the series."
    },
    {
        "fun_fact": "The 'Psych-Outs' at the end of many episodes feature the cast and crew having fun or breaking character while filming."
    },
    {
        "fun_fact": "The actor who plays Shawn’s father, Corbin Bernsen, was cast partially because he was Steve Franks’ childhood TV hero."
    },
    {
        "fun_fact": "In Season 5, 'Dual Spires' is an homage to the cult TV show 'Twin Peaks,' with many of the original cast guest-starring."
    },
    {
        "fun_fact": "Psych ran for eight seasons and inspired three reunion movies: 'Psych: The Movie' (2017), 'Psych 2: Lassie Come Home' (2020), and 'Psych 3: This Is Gus' (2021)."
    },
    {
        "fun_fact": "One of the show's most famous guest stars, John Cena, plays Juliet's brother Ewan O'Hara, who is a highly-trained military operative."
    },
    {
        "fun_fact": "The characters of Shawn and Gus frequently reference 1980s pop culture, a nod to the childhood nostalgia of the show's creators."
    },
    {
        "fun_fact": "Psych was one of the first USA Network shows to engage heavily with fans through social media, creating a strong fanbase known as 'Psych-Os.'"
    }
]
